{
  "mahabharata": {
    "short": "An AI-generated overview of the Mahabharata highlighting its central conflict, key characters, and moral dilemmas as a pre-reading aid.",
    "full": "The Mahabharata is one of the greatest epics ever written, not just because of its length, but because of the depth of ideas it explores. At its heart, the Mahabharata is a story about human choices, moral dilemmas, and the consequences of action.\n\nThe story revolves around two branches of the same royal family — the Pandavas and the Kauravas — who are heirs to the throne of Hastinapura. Though they share the same lineage, their values and paths differ greatly.\n\nOne of the most defining moments of the epic is the game of dice, where the Pandavas lose their kingdom through deception. This moment highlights how blind adherence to rules without wisdom can lead to injustice.\n\nAs the story progresses toward the Kurukshetra war, the epic explores themes of duty, sacrifice, and moral responsibility. The Bhagavad Gita, delivered by Krishna to Arjuna, presents profound philosophical guidance on action and detachment.\n\nThe Mahabharata ultimately reminds us that victory does not come without loss, and that true wisdom lies in understanding one’s duty while remaining compassionate and self-aware."
  },

  "ramayana": {
        "short": "An AI-generated summary of the Ramayana outlining its main narrative, characters, and moral lessons as a pre-reading aid.",
        "full": "The Ramayana is an ancient Indian epic that narrates the life and adventures of Prince Rama, his wife Sita, and his loyal companion Hanuman. It is a tale of love, duty, honor, and the triumph of good over evil.\n\nThe story begins in the kingdom of Ayodhya, where Rama is born as the eldest son of King Dasharatha. Rama is known for his virtues and adherence to dharma (righteousness). However, due to palace intrigues, Rama is exiled to the forest for 14 years along with Sita and his brother Lakshmana.\n\nDuring their exile, Sita is abducted by the demon king Ravana, leading to a series of events that culminate in a great war. With the help of Hanuman and an army of monkeys, Rama wages a battle against Ravana to rescue Sita.\n\nThe Ramayana explores themes of loyalty, devotion, and the importance of fulfilling one's duties. It also delves into the complexities of human emotions and relationships. The epic concludes with Rama's return to Ayodhya and his coronation as king, symbolizing the restoration of order and righteousness."
    }
}
